import Image from "next/image";
import React from "react";
const hMember = [
  {
    LastName: "Ядмаагийн",
    FirstName: "МИШИГЛҮНДЭН",
    image: "/assets/honoraryMembers/mishiglunden.jpg",
    history:
      " 1971 онд Сангийн яамнаас ажил хөдөлмөрийн гараагаа эхэлж, Үндэсний татварын ерөнхий газарт хэлтэс, газрын дарга, дэд дарга, Сургалтын төвийн захирал, Улсын бүртгэлийн албаны дарга, Дэд дарга гэсэн албуудыг хашиж санхүү, татварын албанд 41 жил ажилласан бөгөөд шинэ үеийн татварын тогтолцооны боловсон хүчнийг бэлтгэх, мэргэшүүлэх үйл хэргийг гардан хэрэгжүүлсэн.",
  },
  {
    LastName: "Ядмаагийн",
    FirstName: "МИШИГЛҮНДЭН",
    image: "/assets/honoraryMembers/mishiglunden.jpg",
    history:
      " 1971 онд Сангийн яамнаас ажил хөдөлмөрийн гараагаа эхэлж, Үндэсний татварын ерөнхий газарт хэлтэс, газрын дарга, дэд дарга, Сургалтын төвийн захирал, Улсын бүртгэлийн албаны дарга, Дэд дарга гэсэн албуудыг хашиж санхүү, татварын албанд 41 жил ажилласан бөгөөд шинэ үеийн татварын тогтолцооны боловсон хүчнийг бэлтгэх, мэргэшүүлэх үйл хэргийг гардан хэрэгжүүлсэн.",
  },
  {
    LastName: "Ядмаагийн",
    FirstName: "МИШИГЛҮНДЭН",
    image: "/assets/honoraryMembers/mishiglunden.jpg",
    history:
      " 1971 онд Сангийн яамнаас ажил хөдөлмөрийн гараагаа эхэлж, Үндэсний татварын ерөнхий газарт хэлтэс, газрын дарга, дэд дарга, Сургалтын төвийн захирал, Улсын бүртгэлийн албаны дарга, Дэд дарга гэсэн албуудыг хашиж санхүү, татварын албанд 41 жил ажилласан бөгөөд шинэ үеийн татварын тогтолцооны боловсон хүчнийг бэлтгэх, мэргэшүүлэх үйл хэргийг гардан хэрэгжүүлсэн.",
  },
  {
    LastName: "Ядмаагийн",
    FirstName: "МИШИГЛҮНДЭН",
    image: "/assets/honoraryMembers/mishiglunden.jpg",
    history:
      " 1971 онд Сангийн яамнаас ажил хөдөлмөрийн гараагаа эхэлж, Үндэсний татварын ерөнхий газарт хэлтэс, газрын дарга, дэд дарга, Сургалтын төвийн захирал, Улсын бүртгэлийн албаны дарга, Дэд дарга гэсэн албуудыг хашиж санхүү, татварын албанд 41 жил ажилласан бөгөөд шинэ үеийн татварын тогтолцооны боловсон хүчнийг бэлтгэх, мэргэшүүлэх үйл хэргийг гардан хэрэгжүүлсэн.",
  },
  {
    LastName: "Ядмаагийн",
    FirstName: "МИШИГЛҮНДЭН",
    image: "/assets/honoraryMembers/mishiglunden.jpg",
    history:
      " 1971 онд Сангийн яамнаас ажил хөдөлмөрийн гараагаа эхэлж, Үндэсний татварын ерөнхий газарт хэлтэс, газрын дарга, дэд дарга, Сургалтын төвийн захирал, Улсын бүртгэлийн албаны дарга, Дэд дарга гэсэн албуудыг хашиж санхүү, татварын албанд 41 жил ажилласан бөгөөд шинэ үеийн татварын тогтолцооны боловсон хүчнийг бэлтгэх, мэргэшүүлэх үйл хэргийг гардан хэрэгжүүлсэн.",
  },
  {
    LastName: "Ядмаагийн",
    FirstName: "МИШИГЛҮНДЭН",
    image: "/assets/honoraryMembers/mishiglunden.jpg",
    history:
      " 1971 онд Сангийн яамнаас ажил хөдөлмөрийн гараагаа эхэлж, Үндэсний татварын ерөнхий газарт хэлтэс, газрын дарга, дэд дарга, Сургалтын төвийн захирал, Улсын бүртгэлийн албаны дарга, Дэд дарга гэсэн албуудыг хашиж санхүү, татварын албанд 41 жил ажилласан бөгөөд шинэ үеийн татварын тогтолцооны боловсон хүчнийг бэлтгэх, мэргэшүүлэх үйл хэргийг гардан хэрэгжүүлсэн.",
  },
  {
    LastName: "Ядмаагийн",
    FirstName: "МИШИГЛҮНДЭН",
    image: "/assets/honoraryMembers/mishiglunden.jpg",
    history:
      " 1971 онд Сангийн яамнаас ажил хөдөлмөрийн гараагаа эхэлж, Үндэсний татварын ерөнхий газарт хэлтэс, газрын дарга, дэд дарга, Сургалтын төвийн захирал, Улсын бүртгэлийн албаны дарга, Дэд дарга гэсэн албуудыг хашиж санхүү, татварын албанд 41 жил ажилласан бөгөөд шинэ үеийн татварын тогтолцооны боловсон хүчнийг бэлтгэх, мэргэшүүлэх үйл хэргийг гардан хэрэгжүүлсэн.",
  },
];

const honoraryMember = () => {
  return (
    <>
      <div className="w-full ">
        <div className="w-[1299px] items-center mx-auto">
          <div className="py-24 bg-gradient-to-r from-Gray-600 via-Gray-400 to-Gray-200">
            <h1 className="text-3xl">Хүндэт гишүүн</h1>
            <p>Татварын мэргэшсэн зөвлөхийн нийгэмлэгийн хүндэт гишүүд</p>
          </div>
          <div className="grid grid-cols-4 gap-4 justify-center">
            {hMember.map((utga, index) => {
              return (
                <div>
                  <Image src={utga.image} alt="" width={400} height={600} />
                  <h1 className="text-xl py-4">
                    {utga.LastName}
                    <span className="font-bold m-2"> {utga.FirstName}</span>
                  </h1>
                  <p className="text-justify">{utga.history}</p>
                </div>
              );
            })}
          </div>
        </div>
      </div>
    </>
  );
};

export default honoraryMember;
